Autodesk.Revit.DB.SpanDirectionSymbol.GetDefaultPlacementPoint(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.LinkElementId)
Gets the default placement point for the input element. The default position is in the middle of the bounding box of the top face.
document:
The document.
elemIdToTag:
The ElementId of a Floor (either in the document or linked from another document).
Returns:
Returns the default placement point for the input element. The default position is in the middle of the bounding box of the top face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified elemIdToTag should represent a Floor element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.SpanDirectionSymbol.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId)
Places a new instance of the Span Direction Symbol into the project relative to a particular host element and view.
document:
The document.
viewId:
The id of the view in which the symbol should appear.
elemIdToTag:
The ElementId of a Floor (either in the document or linked from another document).
headPosistion:
The span symbol's head position.
symbolId:
The id of the family symbol of this span symbol.
Returns:
Returns the newly created symbol.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified viewId should represent a Plan View.
-or-
The specified elemIdToTag should represent a Floor element.
-or-
The specified symbolId isn't valid. It should be a FamilySymbol of OST_SpanDirectionSymbol category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.SpanDirectionSymbol
Represents an instance of a Span Direction Symbol in Autodesk Revit.
Since:
2025